{"format": "graph-model", "generatedBy": "1.14.0", "convertedBy": "TensorFlow.js Converter v1.7.4r1", "userDefinedMetadata": {"signature": {"outputs": {"activation_1_1/truediv": {"name": "activation_1_1/truediv"}}}}, "modelTopology": {"node": [{"name": "up_sampling2d_1_1/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "conv2d_1_1/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "512"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv2d_1_1/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv2d_2_1/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "768"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv2d_2_1/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv2d_3_1/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "384"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv2d_3_1/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "up_sampling2d_1_1/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "concatenate_1_1/concat/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "conv_pad_6_1/Pad/paddings", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}, {"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "conv2d_4_1/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "192"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv2d_4_1/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv2d_5_1/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "2"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv2d_5_1/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "reshape_1_1/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "up_sampling2d_1_1/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "reshape_1_1/Reshape/shape/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "reshape_1_1/Reshape/shape/2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "input_1_1", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "224"}, {"size": "224"}, {"size": "3"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv1_1/convolution_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv1_1/convolution_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv_dw_1_1/depthwise_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv_dw_1_1/depthwise_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv_pw_1_1/convolution_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "32"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv_pw_1_1/convolution_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv_dw_2_1/depthwise_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv_dw_2_1/depthwise_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv_pw_2_1/convolution_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "64"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv_pw_2_1/convolution_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv_dw_3_1/depthwise_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv_dw_3_1/depthwise_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv_pw_3_1/convolution_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv_pw_3_1/convolution_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv_dw_4_1/depthwise_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv_dw_4_1/depthwise_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv_pw_4_1/convolution_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "128"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv_pw_4_1/convolution_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv_dw_5_1/depthwise_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv_dw_5_1/depthwise_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv_pw_5_1/convolution_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "256"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv_pw_5_1/convolution_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv_dw_6_1/depthwise_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv_dw_6_1/depthwise_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv_pw_6_1/convolution_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "256"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv_pw_6_1/convolution_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv_dw_7_1/depthwise_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "512"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv_dw_7_1/depthwise_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}}}, {"name": "conv_pw_7_1/convolution_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "512"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv_pw_7_1/convolution_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv_dw_8_1/depthwise_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "512"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv_dw_8_1/depthwise_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv_pw_8_1/convolution_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "512"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv_pw_8_1/convolution_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv_dw_9_1/depthwise_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "512"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv_dw_9_1/depthwise_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv_pw_9_1/convolution_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "512"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv_pw_9_1/convolution_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv_dw_10_1/depthwise_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "512"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv_dw_10_1/depthwise_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv_pw_10_1/convolution_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "512"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv_pw_10_1/convolution_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv_dw_11_1/depthwise_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "512"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv_dw_11_1/depthwise_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv_pw_11_1/convolution_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "512"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv_pw_11_1/convolution_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_1_1/FusedBatchNorm_1/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_1_1/FusedBatchNorm_1/Scaled", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}}}, {"name": "batch_normalization_2_1/FusedBatchNorm_1/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_2_1/FusedBatchNorm_1/Scaled", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_3_1/FusedBatchNorm_1/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_3_1/FusedBatchNorm_1/Scaled", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_4_1/FusedBatchNorm_1/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_4_1/FusedBatchNorm_1/Scaled", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv1_pad_1/Pad", "op": "Pad", "input": ["input_1_1", "conv_pad_6_1/Pad/paddings"], "attr": {"Tpaddings": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "conv1_relu_1/Relu6", "op": "_FusedConv2D", "input": ["conv1_pad_1/Pad", "conv1_1/convolution_weights", "conv1_1/convolution_bn_offset"], "device": "/device:CPU:0", "attr": {"use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "VkFMSUQ="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdTY="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}}}, {"name": "conv_pad_1_1/Pad", "op": "Pad", "input": ["conv1_relu_1/Relu6", "conv_pad_6_1/Pad/paddings"], "attr": {"T": {"type": "DT_FLOAT"}, "Tpaddings": {"type": "DT_INT32"}}}, {"name": "conv_dw_1_1/depthwise", "op": "FusedDepthwiseConv2dNative", "input": ["conv_pad_1_1/Pad", "conv_dw_1_1/depthwise_weights", "conv_dw_1_1/depthwise_bn_offset"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "num_args": {"i": "1"}, "padding": {"s": "VkFMSUQ="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdTY="]}}}}, {"name": "conv_pw_1_relu_1/Relu6", "op": "_FusedConv2D", "input": ["conv_dw_1_1/depthwise", "conv_pw_1_1/convolution_weights", "conv_pw_1_1/convolution_bn_offset"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdTY="]}}}}, {"name": "conv_pad_2_1/Pad", "op": "Pad", "input": ["conv_pw_1_relu_1/Relu6", "conv_pad_6_1/Pad/paddings"], "attr": {"T": {"type": "DT_FLOAT"}, "Tpaddings": {"type": "DT_INT32"}}}, {"name": "conv_dw_2_1/depthwise", "op": "FusedDepthwiseConv2dNative", "input": ["conv_pad_2_1/Pad", "conv_dw_2_1/depthwise_weights", "conv_dw_2_1/depthwise_bn_offset"], "attr": {"padding": {"s": "VkFMSUQ="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdTY="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "num_args": {"i": "1"}}}, {"name": "conv_pw_2_relu_1/Relu6", "op": "_FusedConv2D", "input": ["conv_dw_2_1/depthwise", "conv_pw_2_1/convolution_weights", "conv_pw_2_1/convolution_bn_offset"], "device": "/device:CPU:0", "attr": {"strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdTY="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "conv_pad_3_1/Pad", "op": "Pad", "input": ["conv_pw_2_relu_1/Relu6", "conv_pad_6_1/Pad/paddings"], "attr": {"T": {"type": "DT_FLOAT"}, "Tpaddings": {"type": "DT_INT32"}}}, {"name": "conv_dw_3_1/depthwise", "op": "FusedDepthwiseConv2dNative", "input": ["conv_pad_3_1/Pad", "conv_dw_3_1/depthwise_weights", "conv_dw_3_1/depthwise_bn_offset"], "attr": {"padding": {"s": "VkFMSUQ="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdTY="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}}}, {"name": "conv_pw_3_relu_1/Relu6", "op": "_FusedConv2D", "input": ["conv_dw_3_1/depthwise", "conv_pw_3_1/convolution_weights", "conv_pw_3_1/convolution_bn_offset"], "device": "/device:CPU:0", "attr": {"data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdTY="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "conv_pad_4_1/Pad", "op": "Pad", "input": ["conv_pw_3_relu_1/Relu6", "conv_pad_6_1/Pad/paddings"], "attr": {"T": {"type": "DT_FLOAT"}, "Tpaddings": {"type": "DT_INT32"}}}, {"name": "conv_dw_4_1/depthwise", "op": "FusedDepthwiseConv2dNative", "input": ["conv_pad_4_1/Pad", "conv_dw_4_1/depthwise_weights", "conv_dw_4_1/depthwise_bn_offset"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}, "num_args": {"i": "1"}, "padding": {"s": "VkFMSUQ="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdTY="]}}}}, {"name": "conv_pw_4_relu_1/Relu6", "op": "_FusedConv2D", "input": ["conv_dw_4_1/depthwise", "conv_pw_4_1/convolution_weights", "conv_pw_4_1/convolution_bn_offset"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdTY="]}}}}, {"name": "conv_pad_5_1/Pad", "op": "Pad", "input": ["conv_pw_4_relu_1/Relu6", "conv_pad_6_1/Pad/paddings"], "attr": {"T": {"type": "DT_FLOAT"}, "Tpaddings": {"type": "DT_INT32"}}}, {"name": "conv_dw_5_1/depthwise", "op": "FusedDepthwiseConv2dNative", "input": ["conv_pad_5_1/Pad", "conv_dw_5_1/depthwise_weights", "conv_dw_5_1/depthwise_bn_offset"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "padding": {"s": "VkFMSUQ="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdTY="]}}}}, {"name": "conv_pw_5_relu_1/Relu6", "op": "_FusedConv2D", "input": ["conv_dw_5_1/depthwise", "conv_pw_5_1/convolution_weights", "conv_pw_5_1/convolution_bn_offset"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdTY="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}}}, {"name": "conv_pad_6_1/Pad", "op": "Pad", "input": ["conv_pw_5_relu_1/Relu6", "conv_pad_6_1/Pad/paddings"], "attr": {"T": {"type": "DT_FLOAT"}, "Tpaddings": {"type": "DT_INT32"}}}, {"name": "conv_dw_6_1/depthwise", "op": "FusedDepthwiseConv2dNative", "input": ["conv_pad_6_1/Pad", "conv_dw_6_1/depthwise_weights", "conv_dw_6_1/depthwise_bn_offset"], "attr": {"fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdTY="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "num_args": {"i": "1"}, "padding": {"s": "VkFMSUQ="}}}, {"name": "conv_pw_6_relu_1/Relu6", "op": "_FusedConv2D", "input": ["conv_dw_6_1/depthwise", "conv_pw_6_1/convolution_weights", "conv_pw_6_1/convolution_bn_offset"], "device": "/device:CPU:0", "attr": {"strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdTY="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "conv_pad_7_1/Pad", "op": "Pad", "input": ["conv_pw_6_relu_1/Relu6", "conv_pad_6_1/Pad/paddings"], "attr": {"Tpaddings": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "conv_dw_7_1/depthwise", "op": "FusedDepthwiseConv2dNative", "input": ["conv_pad_7_1/Pad", "conv_dw_7_1/depthwise_weights", "conv_dw_7_1/depthwise_bn_offset"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "padding": {"s": "VkFMSUQ="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdTY="]}}}}, {"name": "conv_pw_7_relu_1/Relu6", "op": "_FusedConv2D", "input": ["conv_dw_7_1/depthwise", "conv_pw_7_1/convolution_weights", "conv_pw_7_1/convolution_bn_offset"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdTY="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "conv_pad_8_1/Pad", "op": "Pad", "input": ["conv_pw_7_relu_1/Relu6", "conv_pad_6_1/Pad/paddings"], "attr": {"T": {"type": "DT_FLOAT"}, "Tpaddings": {"type": "DT_INT32"}}}, {"name": "conv_dw_8_1/depthwise", "op": "FusedDepthwiseConv2dNative", "input": ["conv_pad_8_1/Pad", "conv_dw_8_1/depthwise_weights", "conv_dw_8_1/depthwise_bn_offset"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "padding": {"s": "VkFMSUQ="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdTY="]}}}}, {"name": "conv_pw_8_relu_1/Relu6", "op": "_FusedConv2D", "input": ["conv_dw_8_1/depthwise", "conv_pw_8_1/convolution_weights", "conv_pw_8_1/convolution_bn_offset"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdTY="]}}}}, {"name": "conv_pad_9_1/Pad", "op": "Pad", "input": ["conv_pw_8_relu_1/Relu6", "conv_pad_6_1/Pad/paddings"], "attr": {"T": {"type": "DT_FLOAT"}, "Tpaddings": {"type": "DT_INT32"}}}, {"name": "conv_dw_9_1/depthwise", "op": "FusedDepthwiseConv2dNative", "input": ["conv_pad_9_1/Pad", "conv_dw_9_1/depthwise_weights", "conv_dw_9_1/depthwise_bn_offset"], "attr": {"num_args": {"i": "1"}, "padding": {"s": "VkFMSUQ="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdTY="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "conv_pw_9_relu_1/Relu6", "op": "_FusedConv2D", "input": ["conv_dw_9_1/depthwise", "conv_pw_9_1/convolution_weights", "conv_pw_9_1/convolution_bn_offset"], "device": "/device:CPU:0", "attr": {"data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdTY="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "conv_pad_10_1/Pad", "op": "Pad", "input": ["conv_pw_9_relu_1/Relu6", "conv_pad_6_1/Pad/paddings"], "attr": {"T": {"type": "DT_FLOAT"}, "Tpaddings": {"type": "DT_INT32"}}}, {"name": "conv_dw_10_1/depthwise", "op": "FusedDepthwiseConv2dNative", "input": ["conv_pad_10_1/Pad", "conv_dw_10_1/depthwise_weights", "conv_dw_10_1/depthwise_bn_offset"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "num_args": {"i": "1"}, "padding": {"s": "VkFMSUQ="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdTY="]}}}}, {"name": "conv_pw_10_relu_1/Relu6", "op": "_FusedConv2D", "input": ["conv_dw_10_1/depthwise", "conv_pw_10_1/convolution_weights", "conv_pw_10_1/convolution_bn_offset"], "device": "/device:CPU:0", "attr": {"use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdTY="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}}}, {"name": "conv_pad_11_1/Pad", "op": "Pad", "input": ["conv_pw_10_relu_1/Relu6", "conv_pad_6_1/Pad/paddings"], "attr": {"T": {"type": "DT_FLOAT"}, "Tpaddings": {"type": "DT_INT32"}}}, {"name": "conv_dw_11_1/depthwise", "op": "FusedDepthwiseConv2dNative", "input": ["conv_pad_11_1/Pad", "conv_dw_11_1/depthwise_weights", "conv_dw_11_1/depthwise_bn_offset"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "padding": {"s": "VkFMSUQ="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdTY="]}}}}, {"name": "conv_pw_11_relu_1/Relu6", "op": "_FusedConv2D", "input": ["conv_dw_11_1/depthwise", "conv_pw_11_1/convolution_weights", "conv_pw_11_1/convolution_bn_offset"], "device": "/device:CPU:0", "attr": {"epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdTY="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}}}, {"name": "zero_padding2d_1_1/Pad", "op": "Pad", "input": ["conv_pw_11_relu_1/Relu6", "conv_pad_6_1/Pad/paddings"], "attr": {"T": {"type": "DT_FLOAT"}, "Tpaddings": {"type": "DT_INT32"}}}, {"name": "conv2d_1_1/Relu", "op": "_FusedConv2D", "input": ["zero_padding2d_1_1/Pad", "conv2d_1_1/kernel", "conv2d_1_1/bias"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "VkFMSUQ="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}}}, {"name": "batch_normalization_1_1/FusedBatchNorm_1/Mul", "op": "Mul", "input": ["batch_normalization_1_1/FusedBatchNorm_1/Scaled", "conv2d_1_1/Relu"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_1_1/FusedBatchNorm_1", "op": "Add", "input": ["batch_normalization_1_1/FusedBatchNorm_1/Mul", "batch_normalization_1_1/FusedBatchNorm_1/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "up_sampling2d_1_1/Shape", "op": "Shape", "input": ["batch_normalization_1_1/FusedBatchNorm_1"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "up_sampling2d_1_1/strided_slice", "op": "StridedSlice", "input": ["up_sampling2d_1_1/Shape", "up_sampling2d_1_1/strided_slice/stack", "up_sampling2d_1_1/strided_slice/stack_1", "up_sampling2d_1_1/strided_slice/stack"], "attr": {"shrink_axis_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}}}, {"name": "up_sampling2d_1_1/mul", "op": "Mul", "input": ["up_sampling2d_1_1/Const", "up_sampling2d_1_1/strided_slice"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "up_sampling2d_1_1/ResizeNearestNeighbor", "op": "ResizeNearestNeighbor", "input": ["batch_normalization_1_1/FusedBatchNorm_1", "up_sampling2d_1_1/mul"], "attr": {"align_corners": {"b": false}, "half_pixel_centers": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "concatenate_1_1/concat", "op": "ConcatV2", "input": ["up_sampling2d_1_1/ResizeNearestNeighbor", "conv_pw_5_relu_1/Relu6", "concatenate_1_1/concat/axis"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "zero_padding2d_2_1/Pad", "op": "Pad", "input": ["concatenate_1_1/concat", "conv_pad_6_1/Pad/paddings"], "attr": {"T": {"type": "DT_FLOAT"}, "Tpaddings": {"type": "DT_INT32"}}}, {"name": "conv2d_2_1/Relu", "op": "_FusedConv2D", "input": ["zero_padding2d_2_1/Pad", "conv2d_2_1/kernel", "conv2d_2_1/bias"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "VkFMSUQ="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}}}, {"name": "batch_normalization_2_1/FusedBatchNorm_1/Mul", "op": "Mul", "input": ["batch_normalization_2_1/FusedBatchNorm_1/Scaled", "conv2d_2_1/Relu"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_2_1/FusedBatchNorm_1", "op": "Add", "input": ["batch_normalization_2_1/FusedBatchNorm_1/Mul", "batch_normalization_2_1/FusedBatchNorm_1/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "up_sampling2d_2_1/Shape", "op": "Shape", "input": ["batch_normalization_2_1/FusedBatchNorm_1"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "up_sampling2d_2_1/strided_slice", "op": "StridedSlice", "input": ["up_sampling2d_2_1/Shape", "up_sampling2d_1_1/strided_slice/stack", "up_sampling2d_1_1/strided_slice/stack_1", "up_sampling2d_1_1/strided_slice/stack"], "attr": {"shrink_axis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}}, {"name": "up_sampling2d_2_1/mul", "op": "Mul", "input": ["up_sampling2d_1_1/Const", "up_sampling2d_2_1/strided_slice"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "up_sampling2d_2_1/ResizeNearestNeighbor", "op": "ResizeNearestNeighbor", "input": ["batch_normalization_2_1/FusedBatchNorm_1", "up_sampling2d_2_1/mul"], "attr": {"align_corners": {"b": false}, "half_pixel_centers": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "concatenate_2_1/concat", "op": "ConcatV2", "input": ["up_sampling2d_2_1/ResizeNearestNeighbor", "conv_pw_3_relu_1/Relu6", "concatenate_1_1/concat/axis"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "zero_padding2d_3_1/Pad", "op": "Pad", "input": ["concatenate_2_1/concat", "conv_pad_6_1/Pad/paddings"], "attr": {"T": {"type": "DT_FLOAT"}, "Tpaddings": {"type": "DT_INT32"}}}, {"name": "conv2d_3_1/Relu", "op": "_FusedConv2D", "input": ["zero_padding2d_3_1/Pad", "conv2d_3_1/kernel", "conv2d_3_1/bias"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "VkFMSUQ="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}}}, {"name": "batch_normalization_3_1/FusedBatchNorm_1/Mul", "op": "Mul", "input": ["batch_normalization_3_1/FusedBatchNorm_1/Scaled", "conv2d_3_1/Relu"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_3_1/FusedBatchNorm_1", "op": "Add", "input": ["batch_normalization_3_1/FusedBatchNorm_1/Mul", "batch_normalization_3_1/FusedBatchNorm_1/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "up_sampling2d_3_1/Shape", "op": "Shape", "input": ["batch_normalization_3_1/FusedBatchNorm_1"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "up_sampling2d_3_1/strided_slice", "op": "StridedSlice", "input": ["up_sampling2d_3_1/Shape", "up_sampling2d_1_1/strided_slice/stack", "up_sampling2d_1_1/strided_slice/stack_1", "up_sampling2d_1_1/strided_slice/stack"], "attr": {"Index": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}}}, {"name": "up_sampling2d_3_1/mul", "op": "Mul", "input": ["up_sampling2d_1_1/Const", "up_sampling2d_3_1/strided_slice"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "up_sampling2d_3_1/ResizeNearestNeighbor", "op": "ResizeNearestNeighbor", "input": ["batch_normalization_3_1/FusedBatchNorm_1", "up_sampling2d_3_1/mul"], "attr": {"align_corners": {"b": false}, "half_pixel_centers": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "concatenate_3_1/concat", "op": "ConcatV2", "input": ["up_sampling2d_3_1/ResizeNearestNeighbor", "conv_pw_1_relu_1/Relu6", "concatenate_1_1/concat/axis"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "zero_padding2d_4_1/Pad", "op": "Pad", "input": ["concatenate_3_1/concat", "conv_pad_6_1/Pad/paddings"], "attr": {"Tpaddings": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "conv2d_4_1/Relu", "op": "_FusedConv2D", "input": ["zero_padding2d_4_1/Pad", "conv2d_4_1/kernel", "conv2d_4_1/bias"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "VkFMSUQ="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}}}, {"name": "batch_normalization_4_1/FusedBatchNorm_1/Mul", "op": "Mul", "input": ["batch_normalization_4_1/FusedBatchNorm_1/Scaled", "conv2d_4_1/Relu"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_4_1/FusedBatchNorm_1", "op": "Add", "input": ["batch_normalization_4_1/FusedBatchNorm_1/Mul", "batch_normalization_4_1/FusedBatchNorm_1/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv2d_5_1/BiasAdd", "op": "_FusedConv2D", "input": ["batch_normalization_4_1/FusedBatchNorm_1", "conv2d_5_1/kernel", "conv2d_5_1/bias"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}}}, {"name": "reshape_1_1/Shape", "op": "Shape", "input": ["conv2d_5_1/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "reshape_1_1/strided_slice", "op": "StridedSlice", "input": ["reshape_1_1/Shape", "reshape_1_1/strided_slice/stack", "up_sampling2d_1_1/strided_slice/stack", "up_sampling2d_1_1/strided_slice/stack"], "attr": {"Index": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}}}, {"name": "reshape_1_1/Reshape/shape", "op": "Pack", "input": ["reshape_1_1/strided_slice", "reshape_1_1/Reshape/shape/1", "reshape_1_1/Reshape/shape/2"], "attr": {"T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "3"}}}, {"name": "reshape_1_1/Reshape", "op": "Reshape", "input": ["conv2d_5_1/BiasAdd", "reshape_1_1/Reshape/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "activation_1_1/Max", "op": "Max", "input": ["reshape_1_1/Reshape", "reshape_1_1/Reshape/shape/2"], "attr": {"keep_dims": {"b": true}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "activation_1_1/sub", "op": "Sub", "input": ["reshape_1_1/Reshape", "activation_1_1/Max"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "activation_1_1/Exp", "op": "Exp", "input": ["activation_1_1/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "activation_1_1/Sum", "op": "Sum", "input": ["activation_1_1/Exp", "reshape_1_1/Reshape/shape/2"], "attr": {"keep_dims": {"b": true}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "activation_1_1/truediv", "op": "RealDiv", "input": ["activation_1_1/Exp", "activation_1_1/Sum"], "attr": {"T": {"type": "DT_FLOAT"}}}], "versions": {}}, "weightsManifest": [{"paths": ["group1-shard1of7.bin", "group1-shard2of7.bin", "group1-shard3of7.bin", "group1-shard4of7.bin", "group1-shard5of7.bin", "group1-shard6of7.bin", "group1-shard7of7.bin"], "weights": [{"name": "up_sampling2d_1_1/Const", "shape": [2], "dtype": "int32"}, {"name": "conv2d_1_1/kernel", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "conv2d_1_1/bias", "shape": [512], "dtype": "float32"}, {"name": "conv2d_2_1/kernel", "shape": [3, 3, 768, 256], "dtype": "float32"}, {"name": "conv2d_2_1/bias", "shape": [256], "dtype": "float32"}, {"name": "conv2d_3_1/kernel", "shape": [3, 3, 384, 128], "dtype": "float32"}, {"name": "conv2d_3_1/bias", "shape": [128], "dtype": "float32"}, {"name": "up_sampling2d_1_1/strided_slice/stack_1", "shape": [1], "dtype": "int32"}, {"name": "concatenate_1_1/concat/axis", "shape": [], "dtype": "int32"}, {"name": "conv_pad_6_1/Pad/paddings", "shape": [4, 2], "dtype": "int32"}, {"name": "conv2d_4_1/kernel", "shape": [3, 3, 192, 64], "dtype": "float32"}, {"name": "conv2d_4_1/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_5_1/kernel", "shape": [3, 3, 64, 2], "dtype": "float32"}, {"name": "conv2d_5_1/bias", "shape": [2], "dtype": "float32"}, {"name": "reshape_1_1/strided_slice/stack", "shape": [1], "dtype": "int32"}, {"name": "up_sampling2d_1_1/strided_slice/stack", "shape": [1], "dtype": "int32"}, {"name": "reshape_1_1/Reshape/shape/1", "shape": [], "dtype": "int32"}, {"name": "reshape_1_1/Reshape/shape/2", "shape": [], "dtype": "int32"}, {"name": "conv1_1/convolution_weights", "shape": [3, 3, 3, 32], "dtype": "float32"}, {"name": "conv1_1/convolution_bn_offset", "shape": [32], "dtype": "float32"}, {"name": "conv_dw_1_1/depthwise_weights", "shape": [3, 3, 32, 1], "dtype": "float32"}, {"name": "conv_dw_1_1/depthwise_bn_offset", "shape": [32], "dtype": "float32"}, {"name": "conv_pw_1_1/convolution_weights", "shape": [1, 1, 32, 64], "dtype": "float32"}, {"name": "conv_pw_1_1/convolution_bn_offset", "shape": [64], "dtype": "float32"}, {"name": "conv_dw_2_1/depthwise_weights", "shape": [3, 3, 64, 1], "dtype": "float32"}, {"name": "conv_dw_2_1/depthwise_bn_offset", "shape": [64], "dtype": "float32"}, {"name": "conv_pw_2_1/convolution_weights", "shape": [1, 1, 64, 128], "dtype": "float32"}, {"name": "conv_pw_2_1/convolution_bn_offset", "shape": [128], "dtype": "float32"}, {"name": "conv_dw_3_1/depthwise_weights", "shape": [3, 3, 128, 1], "dtype": "float32"}, {"name": "conv_dw_3_1/depthwise_bn_offset", "shape": [128], "dtype": "float32"}, {"name": "conv_pw_3_1/convolution_weights", "shape": [1, 1, 128, 128], "dtype": "float32"}, {"name": "conv_pw_3_1/convolution_bn_offset", "shape": [128], "dtype": "float32"}, {"name": "conv_dw_4_1/depthwise_weights", "shape": [3, 3, 128, 1], "dtype": "float32"}, {"name": "conv_dw_4_1/depthwise_bn_offset", "shape": [128], "dtype": "float32"}, {"name": "conv_pw_4_1/convolution_weights", "shape": [1, 1, 128, 256], "dtype": "float32"}, {"name": "conv_pw_4_1/convolution_bn_offset", "shape": [256], "dtype": "float32"}, {"name": "conv_dw_5_1/depthwise_weights", "shape": [3, 3, 256, 1], "dtype": "float32"}, {"name": "conv_dw_5_1/depthwise_bn_offset", "shape": [256], "dtype": "float32"}, {"name": "conv_pw_5_1/convolution_weights", "shape": [1, 1, 256, 256], "dtype": "float32"}, {"name": "conv_pw_5_1/convolution_bn_offset", "shape": [256], "dtype": "float32"}, {"name": "conv_dw_6_1/depthwise_weights", "shape": [3, 3, 256, 1], "dtype": "float32"}, {"name": "conv_dw_6_1/depthwise_bn_offset", "shape": [256], "dtype": "float32"}, {"name": "conv_pw_6_1/convolution_weights", "shape": [1, 1, 256, 512], "dtype": "float32"}, {"name": "conv_pw_6_1/convolution_bn_offset", "shape": [512], "dtype": "float32"}, {"name": "conv_dw_7_1/depthwise_weights", "shape": [3, 3, 512, 1], "dtype": "float32"}, {"name": "conv_dw_7_1/depthwise_bn_offset", "shape": [512], "dtype": "float32"}, {"name": "conv_pw_7_1/convolution_weights", "shape": [1, 1, 512, 512], "dtype": "float32"}, {"name": "conv_pw_7_1/convolution_bn_offset", "shape": [512], "dtype": "float32"}, {"name": "conv_dw_8_1/depthwise_weights", "shape": [3, 3, 512, 1], "dtype": "float32"}, {"name": "conv_dw_8_1/depthwise_bn_offset", "shape": [512], "dtype": "float32"}, {"name": "conv_pw_8_1/convolution_weights", "shape": [1, 1, 512, 512], "dtype": "float32"}, {"name": "conv_pw_8_1/convolution_bn_offset", "shape": [512], "dtype": "float32"}, {"name": "conv_dw_9_1/depthwise_weights", "shape": [3, 3, 512, 1], "dtype": "float32"}, {"name": "conv_dw_9_1/depthwise_bn_offset", "shape": [512], "dtype": "float32"}, {"name": "conv_pw_9_1/convolution_weights", "shape": [1, 1, 512, 512], "dtype": "float32"}, {"name": "conv_pw_9_1/convolution_bn_offset", "shape": [512], "dtype": "float32"}, {"name": "conv_dw_10_1/depthwise_weights", "shape": [3, 3, 512, 1], "dtype": "float32"}, {"name": "conv_dw_10_1/depthwise_bn_offset", "shape": [512], "dtype": "float32"}, {"name": "conv_pw_10_1/convolution_weights", "shape": [1, 1, 512, 512], "dtype": "float32"}, {"name": "conv_pw_10_1/convolution_bn_offset", "shape": [512], "dtype": "float32"}, {"name": "conv_dw_11_1/depthwise_weights", "shape": [3, 3, 512, 1], "dtype": "float32"}, {"name": "conv_dw_11_1/depthwise_bn_offset", "shape": [512], "dtype": "float32"}, {"name": "conv_pw_11_1/convolution_weights", "shape": [1, 1, 512, 512], "dtype": "float32"}, {"name": "conv_pw_11_1/convolution_bn_offset", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_1_1/FusedBatchNorm_1/Offset", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_1_1/FusedBatchNorm_1/Scaled", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_2_1/FusedBatchNorm_1/Offset", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_2_1/FusedBatchNorm_1/Scaled", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_3_1/FusedBatchNorm_1/Offset", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_3_1/FusedBatchNorm_1/Scaled", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_4_1/FusedBatchNorm_1/Offset", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_4_1/FusedBatchNorm_1/Scaled", "shape": [64], "dtype": "float32"}]}]}